tutorials/compressible/rhoPorousSimpleFoam/beaverJoseph/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open Source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         steadyState;
}

gradSchemes
{
    default         Gauss linear;
    grad(U)         Gauss linear;
    grad(p)         Gauss linear;
}

divSchemes
{
    div(phi,U)      Gauss upwind;
    div((muEff*dev2(grad(U).T()))) Gauss linear;
    div(phi,h)      Gauss upwind;
    div(phi,epsilon) Gauss upwind;
    div(phi,k)      Gauss upwind;
    div(phid,p)     Gauss linear;
}

laplacianSchemes
{
    laplacian(muEff,U) Gauss linear corrected;
    laplacian(alphaEff,h) Gauss linear corrected;
    laplacian((rho*rAU),p) Gauss linear corrected;
    laplacian(DepsilonEff,epsilon) Gauss linear corrected;
    laplacian(DkEff,k) Gauss linear corrected;
    laplacian(1,p)  Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
    div(U,p)        upwind phi;
}

snGradSchemes
{
    default         corrected;
}

fluxRequired
{
    default         no;
    p               ;
}

// ************************************************************************* //
